var dice_result;
var pos = 0;
var position = 0;
var correct = 0;
var count = 0;
// ["Καθώς είσαι στο πάρκο δέχεσαι μηνύματα στο κινητό τηλέφωνο από άγνωστο παραλήπτη. Τι κάνεις;", "Απαντώ για να δω ποιος είναι", "Διαγράφω τα μηνύματα", "Παίρνω τηλέφωνο για να ρωτήσω τι θέλει", "Αποθηκεύω το μηνύματα για να τα δείξω στους γονείς μου", "D", "3", "Ο άγνωστος αποστολέας μπορεί να είναι ο οποιοσδήποτε και να θέλει να μας κάνει κακό. Ποτέ δεν απαντάμε σε τέτοια μηνύματα και τηλεφωνήματα. Αναφέρουμε το περιστατικό στους γονείς μας για να χειριστούν το θέμα! <br>Σωστή απάντηση: Δ "], ["Καθώς χρησιμοποιείς τον υπολογιστή εμφανίζεται μια διαφήμιση για δωρεάν ringtone<br> και σου ζητά τον αριθμό πιστωτικής κάρτας των γονιών σου. Τι κάνεις;", "Είναι δωρεάν!! Πατώ στην διαφήμιση", "Το αγνοώ, δεν είναι αλήθεια", "Χρειάζομαι ένα νέο ringtone ας πατήσω σ’ αυτό.", "Όλοι οι φίλοι μου έχουν τέλεια ringtones, είναι ΟΚ να πατήσω στην διαφήμιση.", "B", "1", " Πατώντας για να λάβεις το ringtone σου η ιστοσελίδα υποκλέπτει τα στοιχεία σου. Ποτέ δεν ανοίγουμε το σύνδεσμο! <br>Σωστή απάντηση : Β "], ["Θέλεις να παίξεις ένα παιχνίδι διαδικτυακά το οποίο έχεις ξανά παίξει, όμως αντιμετωπίζεις<br> προβλήματα και δεν μπορείς να ξεκινήσεις. Ένας φίλος σου προσφέρεται να σε βοηθήσει <br>και θέλει τον κωδικό σου. Θα έδινες τον κωδικό σου;", "ΟΧΙ", "ΝΑΙ", "Σίγουρα, ανυπομονώ να παίξω το παιχνίδι", "Δεν είμαι σίγουρος/η.", "A", "1", "Δεν δίνουμε ποτέ το κωδικό μας σε κανένα! Ακόμα και κάποιος φίλος μας αν έχει τον κωδικό μας μπορεί να έχει πρόσβαση στα στοιχεία μας ή να προσποιηθεί ότι είναι εσύ! <br>Σωστή απάντηση: Α"], ["Σου στέλνει κάποιος άγνωστος μήνυμα και είναι πολύ καλός και ευγενικός, σου ζητά να βγείτε.<br> Τι πρέπει να κάνεις;", "Θα καλέσω αστυνομία", "Να πάω μαζί με ένα φίλο μου", "Θα ενημερώσω αμέσως τους γονείς μου", "Αν του μιλώ καιρό και μου φαίνεται συμπαθητικός, θα βγω μαζί του", "C", "2", " Ο άγνωστος αποστολέας μπορεί να είναι ο οποιοσδήποτε και να θέλει να μας κάνει κακό. Ποτέ δεν απαντάμε σε τέτοια μηνύματα και τηλεφωνήματα. Αναφέρουμε το περιστατικό στους γονείς μας για να χειριστούν το θέμα! <br>Σωστή απάντηση: Γ"], ["Καθώς χρησιμοποιείς τον υπολογιστή ένα μήνυμα εμφανίζετε που λέει ότι υπάρχει ιός. Τι κάνεις;", "Κλείνω αμέσως τον υπολογιστή. Δεν θέλω να αρρωστήσω.", "Κλείνω αμέσως τον υπολογιστή, μπορεί να χαλάσει αν πιάσει ιό.", "Συνεχίζω να χρησιμοποιώ τον υπολογιστή αγνοώντας το μήνυμα.", "Τρέχω το πρόγραμμα Antivirus ή φωνάζω κάποιο που ξέρει να με βοηθήσει", "D", "3", "Ένας ιός είναι ένα πρόγραμμα το οποίο μπορεί να καταστρέψει τον υπολογιστή μας. Τα προγράμματα Antivirus είναι υπεύθυνα για να μας προστατεύουν από αυτούς! <br>Σωστή απάντηση : Δ"], ["Τι δεν πρέπει να κάνετε στο διαδίκτυο;", "Να παρενοχλείτε τους άλλους.", "Να αναζητάτε πληροφορίες.", "Να παίζετε παιχνίδια.", "Να ακούτε μουσική", "A", "1", "Δεν χρησιμοποιούμε το διαδίκτυο για μη ηθικούς σκοπούς! <br>Σωστή απάντηση: Α "], ["Η οθόνη του υπολογιστή σας, εμφανίζει ένα μήνυμα το οποίο δεν καταλαβαίνετε. Τι πρέπει να κάνετε;", "Να συνεχίσετε σαν να μην συμβαίνει τίποτα.", "Να κάνετε κλικ, είτε στο OK είτε στο ΝΑΙ(YES).", "Να συμβουλευτείτε τον γονέα ή τον δάσκαλο σας.", "Να κάνετε κλικ, είτε στο ΟΧΙ(No) είτε στο Ακύρωση(Cancel)", "C", "2", "Όταν δεν γνωρίζουμε τι μήνυμα μας έχει εμφανίσει ο υπολογιστής καλό είναι να συμβουλευτούμε κάποιο που γνωρίζει καλύτερα. Ένα μήνυμα μπορεί να είναι σημαντικό και να πρέπει να απαντήσουμε με ΝΑΙ,<br> ενώ ένα άλλο καταστροφικό και να πρέπει να πούμε ΟΧΙ. Ποτέ δεν πατάμε στην τύχη! <br>Σωστή απάντηση : Γ"], ["Λαμβάνεις ένα μήνυμα στο ηλεκτρονικό ταχυδρομείο από ένα φίλο σου. <br>Το μήνυμα περιέχει ένα συνημμένο το οποίο δεν περίμενες τι κάνεις.", "Ανοίγω το συνημμένο να δω τι είναι.", "Ανοίγω το συνημμένο, αν έχει ιό το κλείνω", "Στέλνω μήνυμα στο φίλο μου για να μου πει τι περιέχει το συνημμένο.", "Αποθηκεύω το συνημμένο στον υπολογιστή μου αλλά δεν το ανοίγω μέχρι να μου πει ο φίλος μου τι είναι", "C", "3", "Τα συνημμένα αρχεία που υπάρχουν σε ένα μήνυμα ηλεκτρονικού ταχυδρομείου μπορούν να μεταφέρουν ιούς. Ίσως το μήνυμα να μην προέρχεται στα αλήθεια από τον φίλο μας.<br> ΔΕΝ ανοίγουμε ούτε κατεβάζουμε το συνημμένο αρχείο αν δεν γνωρίζουμε το περιεχόμενο του! <br>Σωστή απάντηση: Γ"], ["Προσπαθείς να εγκαταστήσεις ένα νέο παιχνίδι στον υπολογιστή σου. Εμφανίζετε ένα μήνυμα που <br>ζητά να απενεργοποιήσεις το λογισμικό προστασίας από ιούς. Τι κάνεις;", "Απενεργοποιώ το λογισμικό και το ενεργοποιώ πάλι μόλις τελειώσω την εγκατάσταση.", "Αυτό είναι συνηθισμένο μήνυμα εγκατάστασης. Το αγνοώ.", "Το λογισμικό προστασίας από τους ιούς πρέπει να αφαιρεθεί από τον υπολογιστή μου για να τρέξει το νέο πρόγραμμα.", "Σταματώ την εγκατάσταση. Δεν θα απενεργοποιήσω το λογισμικό προστασίας από τους ιούς", "D", "3", "Το λογισμικό προστασίας από ιούς προστατεύει τον υπολογιστή μας από τους ιούς. Δεν το απενεργοποιούμε για κανένα λόγο! <br>Σωστή απάντηση: Δ"], ["Τι κάνουμε όταν κάποιος χρήστης του διαδικτύου μας ενοχλεί με προσβλητικά και απειλητικά μηνύματα;", "Αγνοούμε τα μηνύματά του, μπλοκάρουμε τον λογαριασμό του και ειδοποιούμε τους υπεύθυνους της υπηρεσίας που χρησιμοποιούμε κάνοντας σχετική καταγγελία.", "Ανταποδίδουμε χρησιμοποιώντας και στέλνοντας μηνύματα με παρόμοιο περιεχόμενο.", "Διαγράφω τα μηνύματα μην τα δει κάποιος άλλος", "Λέω στους φίλους μου να ανταποδώσουν και αυτοί τα μηνύματα.", "A", "2", " Δεν χρησιμοποιούμε το διαδίκτυο για μη ηθικούς σκοπούς! Αν παρατηρήσουμε ή υποψιαστούμε ότι κάποιος άλλος χρήστης το πράττει, το αναφέρουμε! <br>Σωστή απάντηση : Α "], ["Ένας χρήστης του διαδικτύου υπόσχεται πως θα μας στείλει ένα ακριβό παιχνίδι σε πολύ καλή τιμή.<br> Το μόνο που ζητάει είναι να του δώσουμε τον αριθμό της πιστωτικής κάρτας των γονέων μας", "Δεχόμαστε τον τρόπο συναλλαγής που μας ζητάει, χωρίς να κάνουμε κανέναν έλεγχο,  μιας και τόσο φθηνά δε θα βρούμε πουθενά αλλού το παιχνίδι.", "Απορρίπτουμε την πρόταση και του ζητάμε να γίνει η συναλλαγή με έναν άλλο τρόπο.", "Δεχόμαστε αλλά πρέπει να πιάσουμε κρυφά από τους γονείς μας την πιστωτική κάρτα.", "Ζητάμε από τους γονείς μας την πιστωτική κάρτα.", "B", "1", "Ο κάτοχος των αριθμών της πιστωτικής κάρτας μπορεί να κάνει ανάληψη οποιονδήποτε ποσό. Δεν τους μοιραζόμαστε με κανένα! <br>Σωστή απάντηση : Β"], ["Εμφανίστηκε στην οθόνη μας ένα μήνυμα που προειδοποιεί πως κινδυνεύει ο υπολογιστής μας και πρέπει<br> να δώσουμε πρόσβαση σε μια, άγνωστη σε εμάς, εταιρία για να τον προστατεύσει", "Δεν δίνουμε πρόσβαση και προσπαθούμε να μάθουμε περισσότερα στοιχεία για τον κίνδυνο που μας προειδοποιεί η συγκεκριμένη εταιρία.", "Δίνουμε ελεύθερη πρόσβαση μιας και υπόσχεται η εταιρία την ασφάλεια του υπολογιστή μας.", "Δίνουμε πρόσβαση μόνο αν γνωρίζουμε την εταιρεία.", "Δίνουμε πρόσβαση μόνο αν είναι δωρεάν", "A", "3", "Το μήνυμα μπορεί να μην είναι αληθινό. Δεν δίνουμε πρόσβαση στον υπολογιστή μας αν δεν είναι απολύτως απαραίτητο και μόνο εάν είμαστε σίγουροι πως η εν λόγο εταιρεία είναι αξιόπιστη! <br>Σωστή απάντηση : Α"], ["Ένα μήνυμα ενημερώνει πως ο λογαριασμός μας σε μια αγαπημένη μας ιστοσελίδα κινδυνεύει να διαγραφεί<br> και ζητάει να στείλουμε σε μια διεύθυνση τα στοιχεία σύνδεσης.", "Στέλνουμε όλα τα στοιχεία σύνδεσης", "Αγνοούμε το μήνυμα.", "Στέλνω τα στοιχεία μου αλλά όχι τον κωδικό", "Στέλνω μόνο τον κωδικό μου", "B", "1", "Το μήνυμα μπορεί να μην είναι αληθινό. Δεν μοιραζόμαστε ποτέ τα στοιχεία σύνδεσης μας! <br>Σωστή απάντηση : Β"], ["Βρίσκεις ένα κωδικό στα πατατάκια, τον οποίο αν βάλεις στο διαδίκτυο κερδίζεις δωρεάν ταινία. Τι κανείς; ", "  Πετάω αμέσως τον κωδικό στον κάλαθο ", "   Ζητάω βοήθεια από κάποιο ενήλικα για να κερδίσω την ταινία ", "Μόνος μου μπαίνω στην ιστοσελίδα και δοκιμάζω τον κωδικό ", "   Βάζω λανθασμένους κωδικούς για να κερδίσω πολλές ταινίες ", "B", "1", "Σωστή απάντηση είναι να ζητήσεις βοήθεια από κάποιο ενήλικα ώστε να βάλει σωστά τον κωδικό και να κερδίσεις το δώρο <br>Σωστή απάντηση : B"], ["Μπαίνεις κατά λάθος σε μια ιστοσελίδα που έχει μέσα λόγια που κρύβουν μίσος, βία και  γυμνούς ανθρώπους. Τι κανείς;", "Κάθομαι και βλέπω όλες τις εικόνες ", "Δείχνω την ιστοσελίδα και σε φίλους μου ", "Αποθηκεύω την ιστοσελίδα ώστε να μπαίνω συχνά ", "Ενημερώνω τους γονείς μου ή την δασκάλα μου για την ιστοσελίδα που βρήκα ", "D", "2", "Ιστοσελίδες με τέτοιο περιεχόμενο είναι απαγορευμένες και πρέπει ένας ενήλικας να καταγγείλει την ιστοσελίδα<br>, για αυτό τον λόγο πρέπει να ενημερώσεις έναν ενήλικα αμέσως <br>Σωστή απάντηση : Δ"], ["Βρίσκεσαι στο διαδίκτυο και βρίσκεις μια ελκυστική διαφήμιση για ένα υπέροχο παιχνίδι. Τι κανείς; ", "    Κλέβω την βίζα του Μπαμπά και βάζω τα στοιχεία της στο διαδίκτυο για να αγοράσω μυστικά το παιχνίδι ", "Κλέβω την βίζα κάποιου άγνωστου και βάζω τα στοιχεία της στο διαδίκτυο για να αγοράσω μυστικά το παιχνίδι ", "Ζητάω ευγενικά από τους γονείς μου, να μου αγοράσουν το παιχνίδι , αν κρίνουν ασφαλή την ιστοσελίδα ", "Στέλνω απειλητικό email στην ιστοσελίδα να μου κάνουν δώρο το παιχνίδι ", "C", "3", "Δεν είναι σωστό να κλέβεις , ούτε να εκβιάζεις μέσω διαδικτύου , η σωστή απάντηση είναι να ενημερώσεις τους γονείς σου για το παιχνίδι<br> που θέλεις να αγοράσεις και αν κρίνουν ότι το χρειάζεσαι να σου το παραγγείλουν<br>Σωστή απάντηση : Γ"], ["Βρίσκεσαι στο διαδίκτυο και βρίσκεις ένα υπέροχο φόρεμα που μπορείς να κανείς δώρο στην μαμά σου. Τι κανείς; ", "    Κλέβω την βίζα του Μπαμπά και βάζω τα στοιχεία της στο διαδίκτυο για να αγοράσω μυστικά το φόρεμα ", "Κλέβω την βίζα κάποιου άγνωστου και βάζω τα στοιχεία της στο διαδίκτυο για να αγοράσω μυστικά το φόρεμα", "Ζητάω ευγενικά από τον πατέρα μου, να μου αγοράσουν το φόρεμα για την μαμά , αν κρίνει ασφαλή την ιστοσελίδα ", "Στέλνω απειλητικό email στην ιστοσελίδα να μου κάνουν δώρο το φόρεμα ", "C", "2", "Δεν είναι σωστό να κλέβεις , ούτε να εκβιάζεις μέσω διαδικτύου , η σωστή απάντηση είναι να ενημερώσεις τον πατέρα σου για το δώρο που θέλεις να αγοράσεις στην μητέρα σου <br>Σωστή απάντηση : Γ"], ["Πόσες ώρες μπορείς να βρίσκεσαι στο διαδίκτυο ; ", "Όσες ώρες με αφήνουν οι γονείς μου ", "  Όσες ώρες με αφήνει οι γονείς μου και ακόμα κάποιες ώρες που μπαίνω κρυφά ", "   όλη μέρα ", "   όσες ώρες θέλω ", "A", "2", "Μπαίνεις όσες ώρες σου επιτρέπουν οι γονείς σου γιατί εκείνοι ξέρουν ότι ο χρόνος είναι πολύτιμος και <br>δεν πρέπει να τον ξοδεύουμε σε διαδικτυακά παιχνίδια αλλά πρέπει να κοινωνικοποίησε<br> και να διαβάζεις τα μαθήματα σου<br>Σωστή απάντηση : A "], ["Οι γονείς σου σε έχουν μάθει να χρησιμοποιείς ευγενικά και σωστά τον ηλεκτρονικό υπολογιστή στο σπίτι. <br>Όταν βρίσκεσαι στον Η.Υ του σχολείου τι κανείς ;", "    Χρησιμοποιώ το ίδιο ευγενικά και τους δυο υπολογιστές ", "Χρησιμοποιώ ευγενικά μόνο τον υπολογιστή στο σπίτι και από τον υπολογιστή του σχολείου προσβάλω και κατηγορώ ανθρώπους ", "   Κτυπάω και κλοτσάω τον υπολογιστή του σχολείου ", "Δεν αγγίζω καν τον υπολογιστή του σχολείου για να μην τον χαλάσω και τιμωρηθώ ", "A", "3", "πρέπει να χρησιμοποιείς σωστά και τους δυο υπολογιστές , κανείς δεν θα σε τιμωρήσει αν χαλάσει ο  υπολογιστής γιατί σίγουρα δεν είναι από δικό σου λάθος <br>Σωστή απάντηση : A"], ["Νιώθεις ότι είσαι παραμελημένος  από την οικογένεια σου. Τι κανείς ; ", "  Ζητάω από τους γονείς μου να μου δώσουν περισσότερη σημασία ", "   Μπαίνω όλη μέρα στο διαδίκτυο και παίζω παιχνίδια ", "Μπαίνω όλη μέρα στο διαδίκτυο και διαβάζω άρθρα ", "Μπαίνω όλη μέρα στο διαδίκτυο και βλέπω εικόνες ", "A", "1", "Ζητάω από τους γονείς μου να μου δώσουν περισσότερη σημασία γιατί κανείς άλλος δεν μπορεί να αναπληρώσει το κενό τους<br>Σωστή απάντηση : A"]];
var question,
    chA,
    chB,
    chC,
    chD,
    level,
    info,
    score = 0;


$(document).ready(function() {
	$.ajax({
		url : "../PHP/getQuestions.php",
		dataType : "json",
		success : function(arrData) {
			questions=arrData;
			
			}
		,error: function(){
			console.log("error");
		}
	});

});

function startQuestion() {
	document.getElementById("dice_image").style.visibility = "hidden";
	document.getElementById("bigpic").style.visibility = "visible";
	setTimeout(function() {
		document.getElementById("bigpic").style.visibility = "hidden";
		showQuestion();
	}, 2000);

}

function ShowFinalImage() {
	var sourceOfPicture = "../images/pic.gif";
	var img = document.getElementById('bigpic');
	img.src = sourceOfPicture.replace('90x90', '225x225');
	img.style.display = "block";
}

function setDice(roll) {
	dice_result = roll;
}

function getDice() {
	return dice_result;
}

function showQuestion() {
	var sourceOfPicture;
	$("#myModal").modal();
	var roll = Math.floor(Math.random() * 6) + 1;
	setDice(roll);
	if (dice_result == 1)
		sourceOfPicture = "../images/assos.png";
	else if (dice_result == 2)
		sourceOfPicture = "../images/thkioli.png";
	else if (dice_result == 3)
		sourceOfPicture = "../images/tria.png";
	else if (dice_result == 4)
		sourceOfPicture = "../images/tessera.png";
	else if (dice_result == 5)
		sourceOfPicture = "../images/pente.png";
	else
		sourceOfPicture = "../images/exi.png";
	_('diceResultImage').style.visibility = 'visible';
	_('diceResultImage').src = sourceOfPicture;
	_('next_button').style.visibility = 'hidden';
	_("diceResultText").innerHTML = "Ο αριθμός του ζαριού είναι το " + dice_result + ".";

	renderQuestion();
}

function _(x) {
	return document.getElementById(x);
}

function renderQuestion() {
	var qtext = _("qtext");
	var atext = _("atext");

	//end of game
	if (position >= 45) {
		_("dice_image").innerHTML = "<h2>Έφτασες στο τέλος του παιχνιδιού. Έχεις απαντήσει σωστα  " + correct + " από τις " + count + " ερωτήσεις. H βαθμολογία σου είναι " + score + " .</h2>";
		_("dice_image").style.visibility = 'visible';
		ShowFinalImage();
		test.innerHTML += "<button onclick='showScore()'>Δες την βαθμολογία σου</button>";
		test.innerHTML += "<button id= end onclick='end()'>Τέλος Παιχνιδιού</button>";
		img.style.display = "none";
		var dice_result = document.getElementById("dice_result");
		dice_result.innerHTML = "";
		pos = 0;
		correct = 0;
		return false;
	}

	randPos = getPos(position);//returns ID of question 
	for (var i = 0; i < questions.length; i++) {
		if (randPos == parseInt(questions[i].id)) {			
			pos = i;
			break;
		}
		else {			
		}
	}	
	count++;
	//count questions played so far
	question = questions[pos].text;
	chA = questions[pos].answer1;
	chB = questions[pos].answer2;
	chC = questions[pos].answer3;
	chD = questions[pos].answer4;
	level = questions[pos].level;
	info = questions[pos].info;

	qtext.innerHTML = "<h4>" + question + "</h4>";
	atext.innerHTML += "<input type='radio' name='choices' value='A'> " + chA + "<br>";
	atext.innerHTML += "<input type='radio' name='choices' value='B'> " + chB + "<br>";
	atext.innerHTML += "<input type='radio' name='choices' value='C'> " + chC + "<br>";
	atext.innerHTML += "<input type='radio' name='choices' value='D'> " + chD + "<br><br>";
	atext.innerHTML += "<button id='Answer' style='padding: 10px 24px'; onclick='checkAnswer(level,info)'>Επιλογή Απάντησης</button>";
	atext.innerHTML += "<button id=end style='padding: 10px 24px'; onclick='end()'>Τέλος Παιχνιδιού</button>";
}

function getPos(position) {
	var validq=[];
	var level = 0;
	if (position < 15)
		level = "1";
	else if (position < 30)
		level = "2";
	else
		level = "3";
	console.table(questions);
	for (var j = 0; j < questions.length; j++) {
		if (questions[j].level == level)
			validq.push(questions[j]);
	}
	console.table(validq);
	var size = validq.length;		
	index = Math.floor(Math.random()*(size));
	alert("to zari ekatse "+index);
	return parseInt(validq[index].id);
}

function end() {
	str = "Η βαθμολογία σου είναι:  " + score;
	alert(str);
	window.location = "../HTMLFiles/highScores.html";
}

function checkAnswer(level, info) {
	var choices = document.getElementsByName("choices");
	var choice = 6;
	for (var i = 0; i < choices.length; i++) {
		if (choices[i].checked) {
			choice = choices[i].value;
		}
	}

	if (choice == 6) {
		_("qtext").style.color = 'red';
		msg = "Παρακαλώ δώσε μια απάντηση\n";
		alert(msg);
		return;
	} else
		_("qtext").style.color = 'black';

	_("reactionImage").style.visibility = 'visible';
	_('next_button').style.visibility = 'visible';
	_("qtext").innerHTML = "";
	_("diceResultImage").style.visibility = 'hidden';
	_("diceResultText").innerHTML = "";

	if (choice == questions[pos].correctAnswer) {
		score += level * dice_result;
		cor = "Μπράβο έχεις απαντήσει σωστά. " + info;
		skor = "Η βαθμολογία σου ειναι:" + score;
		atext.innerHTML = "<h3>" + cor + "</h3";
		atext.innerHTML += "<h3>" + skor + "</h3";
		correct++;
		setTimeout(function() {
			_("reactionImage").src = "../images/anim2.gif";
		}, 0);

		position += getDice();
	} else {
		wro = "Λυπάμαι αλλά η απάντηση σου είναι λάθος. " + info;
		skor = "Η βαθμολογία σου ειναι:" + score;

		score = score - (4 - level);
		setTimeout(function() {
			_("reactionImage").src = "../images/anim3.gif";
		}, 0);
		atext.innerHTML = "<h3>" + wro + "</h3";
		atext.innerHTML += "<h3>" + skor + "</h3";
		//alert(wro);
	}

	if (position >= 0 && position <= 15) {
		pos = Math.floor(Math.random() * questions.length);
		while (pos < questions.length - 1 && questions[pos].level != 1) {
			pos = Math.floor(Math.random() * questions.length);
		}
	} else if (position >= 16 && position <= 30) {
		pos = Math.floor(Math.random() * questions.length);
		while (pos < questions.length - 1 && questions[pos].level != 2) {
			pos = Math.floor(Math.random() * questions.length);
		}
	} else if (position >= 31 && position <= 45) {
		pos = Math.floor(Math.random() * questions.length);
		while (pos < questions.length - 1 && questions[pos].level != 3) {
			pos = Math.floor(Math.random() * questions.length);
		}
	} else {
		pos = questions.length + 1;
	}

	var body = document.getElementsByTagName('body')[0];
	if (position >= 45) {
		var str = "../images/tablo45.jpg";
		body.style.backgroundImage = 'url(' + str + ')';
		renderQuestion();
		$('#myModal').modal('hide');

	} else {
		var str = "../images/" + "tablo" + position + ".jpg";
		body.style.backgroundImage = 'url(' + str + ')';
	}
}

function nextQuestion() {
	$('#myModal').modal('hide');
	_("atext").innerHTML = "";
	_("qtext").innerHTML = "";
	_("reactionImage").style.visibility = 'hidden';
	startQuestion();
}

function waitToRoll() {
	_('dice_image').style.visibility = "visible";
	_("bigpic").style.visibility = "hidden";
	_('diceResultImage').style.visibility = "hidden";
	_('diceResultText').style.visibility = "hidden";
	_('qtext').style.visibility = "hidden";
	_('atext').style.visibility = "hidden";
	_('reactionImage').style.visibility = "hidden";
	_('next_button').style.visibility = "hidden";
}